// 로스터 타자 데이터 샘플
var rosterHitterData = [
    {
        team:"깡",
        c:  ["김상수", 400, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12],
        b1: ["김상수", 400, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12],
        b2: ["김상수", 400, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12],
        b3: ["김상수", 400, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12],
        ss: ["김상수", 400, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12],
        lf: ["김상수", 400, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12],
        cf: ["김상수", 400, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12],
        rf: ["김상수", 400, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12],
        dh: ["김상수", 400, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12],
        s1: ["벤치성", 400, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12],
        s2: ["벤치성", 400, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12],
    },
    {
        team:"달",
        c:  ["찬물택", 400, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12],
        b1: ["찬물택", 420, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12],
        b2: ["찬물택", 430, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12],
        b3: ["찬물택", 440, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12],
        ss: ["찬물택", 450, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12],
        lf: ["찬물택", 460, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12],
        cf: ["찬물택", 400, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12],
        rf: ["찬물택", 470, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12],
        dh: ["찬물택", 480, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12],
        s1: null,
        s2: null
    },
    {
        team:"놉",
        c:  ["눕동님", 400, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12],
        b1: ["눕동님", 420, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12],
        b2: ["눕동님", 430, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12],
        b3: ["눕동님", 440, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12],
        ss: ["눕동님", 450, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12],
        lf: ["눕동님", 460, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12],
        cf: ["눕동님", 400, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12],
        rf: ["눕동님", 470, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12],
        dh: ["눕동님", 480, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12],
        s1: null,
        s2: null
    },
    {
        team:"비",
        c:  ["김도망", 400, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12],
        b1: ["김도망", 420, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12],
        b2: ["김도망", 430, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12],
        b3: ["김도망", 440, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12],
        ss: ["김도망", 450, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12],
        lf: ["김도망", 460, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12],
        cf: ["김도망", 400, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12],
        rf: ["김도망", 470, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12],
        dh: ["김도망", 480, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12],
        s1: ["벤치성", 480, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12],
        s2: null,
    },
    {
        team:"쌤",
        c:  ["양준혁", 400, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12],
        b1: ["양준혁", 420, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12],
        b2: ["양준혁", 430, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12],
        b3: ["양준혁", 440, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12],
        ss: ["양준혁", 450, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12],
        lf: ["양준혁", 460, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12],
        cf: ["양준혁", 400, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12],
        rf: ["양준혁", 470, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12],
        dh: ["양준혁", 480, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12],
        s1: null,
        s2: ["벤치성", 480, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12]
    },
    {
        team:"요",
        c:  ["착한이", 400, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12],
        b1: ["착한이", 420, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12],
        b2: ["착한이", 430, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12],
        b3: ["착한이", 440, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12],
        ss: ["착한이", 450, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12],
        lf: ["착한이", 460, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12],
        cf: ["착한이", 400, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12],
        rf: ["착한이", 470, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12],
        dh: ["착한이", 480, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12],
        s1: null,
        s2: ["벤치성", 480, -20, 0.300, 1,2,3,4,5,6,7,8,9,10,11,12]
    }
]

// 로스터 투수 데이터 샘플
var rosterPitcherData = [
    {
        team:"깡",
        p1: ["박찬호", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4],
        p2: ["박찬호", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4],
        p3: ["박찬호", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4],
        p4: ["박찬호", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4],
        p5: ["박찬호", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4],
        p6: ["박찬호", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4],
        p7: ["박찬호", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4],
        p8: ["박찬호", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4],
        p9: ["박찬호", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4],
        s1: null,
        s2: null
    },
    {
        team:"달",
        p1: ["안지만", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4],
        p2: ["안지만", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4],
        p3: ["안지만", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4],
        p4: ["안지만", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4],
        p5: ["안지만", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4],
        p6: ["안지만", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4],
        p7: ["안지만", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4],
        p8: ["안지만", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4],
        p9: ["안지만", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4],
        s1: ["벤치성", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4],
        s2: ["벤치성", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4]
    },
    {
        team:"놉",
        p1: ["오승환", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4],
        p2: ["오승환", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4],
        p3: ["오승환", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4],
        p4: ["오승환", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4],
        p5: ["오승환", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4],
        p6: ["오승환", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4],
        p7: ["오승환", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4],
        p8: ["오승환", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4],
        p9: ["오승환", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4],
        s1: ["벤치성", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4],
        s2: ["벤치성", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4]
    },
    {
        team:"비",
        p1: ["김광현", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4],
        p2: ["김광현", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4],
        p3: ["김광현", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4],
        p4: ["김광현", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4],
        p5: ["김광현", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4],
        p6: ["김광현", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4],
        p7: ["김광현", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4],
        p8: ["김광현", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4],
        p9: ["김광현", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4],
        s1: null,
        s2: ["벤치성", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4]
    },
    {
        team:"쌤",
        p1: ["법규형", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4],
        p2: ["법규형", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4],
        p3: ["법규형", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4],
        p4: ["법규형", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4],
        p5: ["법규형", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4],
        p6: ["법규형", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4],
        p7: ["법규형", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4],
        p8: ["법규형", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4],
        p9: ["법규형", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4],
        s1: ["벤치성", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4],
        s2: null
    },
    {
        team:"요",
        p1: ["배영수", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4],
        p2: ["배영수", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4],
        p3: ["배영수", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4],
        p4: ["배영수", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4],
        p5: ["배영수", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4],
        p6: ["배영수", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4],
        p7: ["배영수", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4],
        p8: ["배영수", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4],
        p9: ["배영수", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4],
        s1: null,
        s2: ["벤치성", 430, 10, 1.20, 0.45, 1,2,3,4,5,6,7, 2.17, 1,2,3,4]
    }
]

// 전역 변수
var hitterPositionDictionary = {
    c:"C",
    b1:"1B",
    b2:"2B",
    b3:"3B",
    ss:"SS",
    lf:"LF",
    cf:"CF",
    rf:"RF",
    dh:"DH",
    s1:"SUB",
    s2:"SUB"
}
var pitcherPositionDictionary = {
    p1:"P",
    p2:"P",
    p3:"P",
    p4:"P",
    p5:"P",
    p6:"P",
    p7:"P",
    p8:"P",
    p9:"P",
    s1:"SUB",
    s2:"SUB"
}
var hitterBodyIndexRange    = [3, 15];
var pitcherBodyIndexRange   = [3, 16];
var hitterBodyDataDecimals  = [3,0,0,0,0,0,0,0,0,0,0,0,0];
var pitcherBodyDataDecimals = [2,2,0,0,0,0,0,0,0,2,0,0,0,0];

var currentRoster = 0;
var currentPosition = 0;

function updateRoster(n) {

    // highlight and un-highlight buttons
    if(currentRoster > 0) {
        $('#team'+currentRoster).removeClass("btn-primary").addClass("btn-outline-primary");
    }
    $('#team'+n).removeClass("btn-outline-primary").addClass("btn-primary");
    currentRoster = n;

    // initialize
    var i;
    var key;
    var innerHTMLString;
    var innerHTMLStringArray;
    var innerHTMLStringArraySlice;
    rosterHitterTableBody.innerHTML   = '';
    rosterPitcherTableBody.innerHTML   = '';

    // update hitter tables
    for(key in hitterPositionDictionary) {
        // read hitter data
        innerHTMLStringArray = rosterHitterData[n-1][key];
        // create a line if not null
        if(innerHTMLStringArray != null) {
            ///// prepare hitter main /////
            innerHTMLString = '<td>' + innerHTMLStringArray[1] + '</td><td>';
            if(innerHTMLStringArray[2] >= 0) {
                innerHTMLString = innerHTMLString + '<span style="color:red;">&#9650;' + innerHTMLStringArray[2] + '</span></td><td>';
            } else {
                innerHTMLString = innerHTMLString + '<span style="color:blue;">&#9660;' + (-1 * Number(innerHTMLStringArray[2])) + '</span></td><td>';
            }
            // slice main body data
            innerHTMLStringArraySlice = innerHTMLStringArray.slice(hitterBodyIndexRange[0], hitterBodyIndexRange[1]+1);
            // specify decimals
            for(i=0; i<innerHTMLStringArraySlice.length; i++) {
                innerHTMLStringArraySlice[i] = Number(innerHTMLStringArraySlice[i]).toFixed(hitterBodyDataDecimals[i]);
            }
            // write hitter head and main
            rosterHitterTableBody.innerHTML = rosterHitterTableBody.innerHTML + '<tr><th scope="row">' + hitterPositionDictionary[key] + '</th><td>' + innerHTMLStringArray[0] + '</td>' + innerHTMLString + innerHTMLStringArraySlice.join('</td><td>') + '</td></tr>';
        }
    }

    // update pitcher tables
    for(key in pitcherPositionDictionary) {
        // read pitcher data
        innerHTMLStringArray = rosterPitcherData[n-1][key];
        // create a line if not null
        if(innerHTMLStringArray != null) {
            ///// prepare hitter main /////
            innerHTMLString = '<td>' + innerHTMLStringArray[1] + '</td><td>';
            if(innerHTMLStringArray[2] >= 0) {
                innerHTMLString = innerHTMLString + '<span style="color:red;">&#9650;' + innerHTMLStringArray[2] + '</span></td><td>';
            } else {
                innerHTMLString = innerHTMLString + '<span style="color:blue;">&#9660;' + (-1 * Number(innerHTMLStringArray[2])) + '</span></td><td>';
            }
            // slice main body data
            innerHTMLStringArraySlice = innerHTMLStringArray.slice(pitcherBodyIndexRange[0], pitcherBodyIndexRange[1]+1);
            // specify decimals
            for(i=0; i<innerHTMLStringArraySlice.length; i++) {
                innerHTMLStringArraySlice[i] = Number(innerHTMLStringArraySlice[i]).toFixed(pitcherBodyDataDecimals[i]);
            }
            // write pitcher head and main
            rosterPitcherTableBody.innerHTML = rosterPitcherTableBody.innerHTML + '<tr><th scope="row">' + pitcherPositionDictionary[key] + '</th><td>' + innerHTMLStringArray[0] + '</td>' + innerHTMLString + innerHTMLStringArraySlice.join('</td><td>') + '</td></tr>';
        }
    }
}

function updatePosition(n) {

    // highlight and un-highlight buttons
    if(currentPosition > 0) {
        $('#position'+currentPosition).removeClass("btn-primary").addClass("btn-outline-primary");
    }
    $('#position'+n).removeClass("btn-outline-primary").addClass("btn-primary");
    currentPosition = n;

    // display relevant table
    if(currentPosition == 1) {
        rosterHitterFrame.hidden = false;
        rosterPitcherFrame.hidden = true;
    } else {
        rosterHitterFrame.hidden = true;
        rosterPitcherFrame.hidden = false;
    }

}

window.onload = function() {
    updateRoster(1);
    updatePosition(1);
}